export interface TaxDetail {
  年月: string;
  所得项目小类: string;
  扣缴义务人: string;
  收入: number;
  已申报税额: number;
}

export interface TaxYearData {
  所属年份: number;
  收入合计: number;
  已申报税额合计: number;
  收入明细: TaxDetail[];
}

export const taxData: TaxYearData[] = [
  {
    "所属年份": 2019,
    "收入合计": 233181.81,
    "已申报税额合计": 13728.88,
    "收入明细": [
      {
        "年月": "2019-12",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通（江苏）软件技...",
        "收入": 18000.0,
        "已申报税额": 1869.05
      },
      {
        "年月": "2019-11",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通（江苏）软件技...",
        "收入": 18000.0,
        "已申报税额": 1257.76
      },
      {
        "年月": "2019-10",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通（江苏）软件技...",
        "收入": 18000.0,
        "已申报税额": 1257.76
      },
      {
        "年月": "2019-09",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通（江苏）软件技...",
        "收入": 18000.0,
        "已申报税额": 1257.76
      },
      {
        "年月": "2019-08",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通（江苏）软件技...",
        "收入": 18000.0,
        "已申报税额": 1257.76
      },
      {
        "年月": "2019-07",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通（江苏）软件技...",
        "收入": 18000.0,
        "已申报税额": 1257.75
      },
      {
        "年月": "2019-06",
        "所得项目小类": "全年一次性奖金收入",
        "扣缴义务人": "慧博云通（江苏）软件技...",
        "收入": 18000.0,
        "已申报税额": 540.0
      },
      {
        "年月": "2019-06",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通（江苏）软件技...",
        "收入": 18000.0,
        "已申报税额": 1257.76
      },
      {
        "年月": "2019-05",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通（江苏）软件技...",
        "收入": 18000.0,
        "已申报税额": 1257.76
      },
      {
        "年月": "2019-04",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通（江苏）软件技...",
        "收入": 18000.0,
        "已申报税额": 1257.76
      },
      {
        "年月": "2019-03",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通（江苏）软件技...",
        "收入": 17181.81,
        "已申报税额": 416.8
      },
      {
        "年月": "2019-02",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通（江苏）软件技...",
        "收入": 18000.0,
        "已申报税额": 377.33
      },
      {
        "年月": "2019-01",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通（江苏）软件技...",
        "收入": 18000.0,
        "已申报税额": 377.33
      }
    ]
  },
  {
    "所属年份": 2020,
    "收入合计": 265568.18,
    "已申报税额合计": 19694.85,
    "收入明细": [
      {
        "年月": "2020-12",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 3015.52
      },
      {
        "年月": "2020-11",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 3015.51
      },
      {
        "年月": "2020-10",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 2092.17
      },
      {
        "年月": "2020-09",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 1507.76
      },
      {
        "年月": "2020-08",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 1507.76
      },
      {
        "年月": "2020-07",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 1507.76
      },
      {
        "年月": "2020-06",
        "所得项目小类": "全年一次性奖金收入",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 615.0
      },
      {
        "年月": "2020-06",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 1507.76
      },
      {
        "年月": "2020-05",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 19568.18,
        "已申报税额": 1414.57
      },
      {
        "年月": "2020-04",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 1507.76
      },
      {
        "年月": "2020-03",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 1098.62
      },
      {
        "年月": "2020-02",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 452.33
      },
      {
        "年月": "2020-01",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 452.33
      }
    ]
  },
  {
    "所属年份": 2021,
    "收入合计": 266581.69,
    "已申报税额合计": 19793.66,
    "收入明细": [
      {
        "年月": "2021-12",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 3006.86
      },
      {
        "年月": "2021-11",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 3006.86
      },
      {
        "年月": "2021-10",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 2145.9
      },
      {
        "年月": "2021-09",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 1503.43
      },
      {
        "年月": "2021-08",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 1503.43
      },
      {
        "年月": "2021-07",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20581.69,
        "已申报税额": 1511.6
      },
      {
        "年月": "2021-06",
        "所得项目小类": "全年一次性奖金收入",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 615.0
      },
      {
        "年月": "2021-06",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 1503.43
      },
      {
        "年月": "2021-05",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 1503.43
      },
      {
        "年月": "2021-04",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 1503.43
      },
      {
        "年月": "2021-03",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 1088.23
      },
      {
        "年月": "2021-02",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 451.03
      },
      {
        "年月": "2021-01",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 451.03
      }
    ]
  },
  {
    "所属年份": 2022,
    "收入合计": 234500.0,
    "已申报税额合计": 11490.78,
    "收入明细": [
      {
        "年月": "2022-12",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "陕西航星数科信息技术有...",
        "收入": 25000.0,
        "已申报税额": 797.69
      },
      {
        "年月": "2022-11",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "陕西航星数科信息技术有...",
        "收入": 25000.0,
        "已申报税额": 585.47
      },
      {
        "年月": "2022-08",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 1501.57
      },
      {
        "年月": "2022-07",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 1501.58
      },
      {
        "年月": "2022-06",
        "所得项目小类": "全年一次性奖金收入",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 615.0
      },
      {
        "年月": "2022-06",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 1501.58
      },
      {
        "年月": "2022-05",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 1501.58
      },
      {
        "年月": "2022-04",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 1501.58
      },
      {
        "年月": "2022-03",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 1083.78
      },
      {
        "年月": "2022-02",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 450.48
      },
      {
        "年月": "2022-01",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "慧博云通科技股份有限公...",
        "收入": 20500.0,
        "已申报税额": 450.47
      }
    ]
  },
  {
    "所属年份": 2023,
    "收入合计": 268818.18,
    "已申报税额合计": 15726.64,
    "收入明细": [
      {
        "年月": "2023-12",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 2244.08
      },
      {
        "年月": "2023-11",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 2244.07
      },
      {
        "年月": "2023-10",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 1294.93
      },
      {
        "年月": "2023-09",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 673.22
      },
      {
        "年月": "2023-07",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "陕西航星数科信息技术有...",
        "收入": 6818.18,
        "已申报税额": 125.9
      },
      {
        "年月": "2023-06",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "陕西航星数科信息技术有...",
        "收入": 25000.0,
        "已申报税额": 1944.07
      },
      {
        "年月": "2023-05",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "陕西航星数科信息技术有...",
        "收入": 25000.0,
        "已申报税额": 1944.07
      },
      {
        "年月": "2023-04",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "陕西航星数科信息技术有...",
        "收入": 25000.0,
        "已申报税额": 1944.08
      },
      {
        "年月": "2023-03",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "陕西航星数科信息技术有...",
        "收入": 25000.0,
        "已申报税额": 1944.07
      },
      {
        "年月": "2023-02",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "陕西航星数科信息技术有...",
        "收入": 25000.0,
        "已申报税额": 784.93
      },
      {
        "年月": "2023-01",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "陕西航星数科信息技术有...",
        "收入": 25000.0,
        "已申报税额": 583.22
      }
    ]
  },
  {
    "所属年份": 2024,
    "收入合计": 358727.27,
    "已申报税额合计": 36651.47,
    "收入明细": [
      {
        "年月": "2024-12",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 4482.17
      },
      {
        "年月": "2024-11",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 4482.17
      },
      {
        "年月": "2024-10",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 4482.16
      },
      {
        "年月": "2024-09",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 4482.17
      },
      {
        "年月": "2024-08",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 4482.17
      },
      {
        "年月": "2024-07",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 3001.4
      },
      {
        "年月": "2024-06",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 2241.08
      },
      {
        "年月": "2024-05",
        "所得项目小类": "全年一次性奖金收入",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 840.0
      },
      {
        "年月": "2024-05",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 2241.09
      },
      {
        "年月": "2024-04",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 22727.27,
        "已申报税额": 1713.81
      },
      {
        "年月": "2024-03",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 2241.08
      },
      {
        "年月": "2024-02",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 1289.84
      },
      {
        "年月": "2024-01",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 672.33
      }
    ]
  },
  {
    "所属年份": 2025,
    "收入合计": 364000.0,
    "已申报税额合计": 38740.27,
    "收入明细": [
      {
        "年月": "2025-12",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 4473.18
      },
      {
        "年月": "2025-11",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 4473.18
      },
      {
        "年月": "2025-10",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 4473.18
      },
      {
        "年月": "2025-09",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 4473.18
      },
      {
        "年月": "2025-08",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 4473.18
      },
      {
        "年月": "2025-07",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 3213.18
      },
      {
        "年月": "2025-06",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 2236.59
      },
      {
        "年月": "2025-05",
        "所得项目小类": "全年一次性奖金收入",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 840.0
      },
      {
        "年月": "2025-05",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 2236.59
      },
      {
        "年月": "2025-04",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 2236.59
      },
      {
        "年月": "2025-03",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 2236.59
      },
      {
        "年月": "2025-02",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 1283.95
      },
      {
        "年月": "2025-01",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 670.98
      }
    ]
  },
  {
    "所属年份": 2026,
    "收入合计": 84000.0,
    "已申报税额合计": 4179.86,
    "收入明细": [
      {
        "年月": "2026-03",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 2231.73
      },
      {
        "年月": "2026-02",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 1278.41
      },
      {
        "年月": "2026-01",
        "所得项目小类": "正常工资薪金",
        "扣缴义务人": "西安花丛间科技有限公司",
        "收入": 28000.0,
        "已申报税额": 669.72
      }
    ]
  }
];

export function getYearData(year: number): TaxYearData | undefined {
  return taxData.find(d => d.所属年份 === year);
}

export const availableYears = taxData.map(d => d.所属年份);
